<a href="https://colab.research.google.com/github/ussalbt/Assignment/blob/main/Assignment_1_Student_(3).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In this assignment you will start off with Numpy Exercises and then complete the whole Exercise with Pandas questions. All the subjects related to questions here already covered in preclass materials and in-class sessions. So good luck!

#### 1. Import NumPy Library

In [3]:
import numpy as np

#### 2. Create an array from my_list=[5,10,15,20,25]

In [4]:
my_list = [5,10,15,20,25]
np.array(my_list)

array([ 5, 10, 15, 20, 25])

#### 3. Generate an array 5x5 zeros

In [5]:
np.zeros((5,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

#### 4. Generate an array 4x4 ones assign data type int

In [6]:
np.ones((4,4),dtype="int")

array([[1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1],
       [1, 1, 1, 1]])

#### 5. Make all the values of the array above 7

In [7]:
np.ones((4,4),dtype="int")*7

array([[7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7]])

#### 6. Create same array above with full method

In [8]:
np.full((4,4),7,dtype="int")

array([[7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7],
       [7, 7, 7, 7]])

#### 7. Create an array of even integers from 2 to 16

In [9]:
np.arange(2,17,2)

array([ 2,  4,  6,  8, 10, 12, 14, 16])

#### 8. Create a 5x5 matrix with values between 0 to 25

In [10]:
np.arange(0,25).reshape(5,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

#### 9. Create a 5x5 matrix with values between 0 to 25 using linspace

In [11]:
np.linspace(0,25,25,dtype="int",endpoint = False).reshape(5,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

#### 10. Create 5 random number with numpy

In [12]:
np.random.rand(5)

array([0.84907132, 0.85426432, 0.50519774, 0.92575284, 0.70510418])

#### 11. Create random normal distributed 5x5 array

In [14]:
np.random.randn(5,5)

array([[-1.76695034,  0.62690276, -1.79321709, -0.44506157,  0.44969089],
       [-0.46520165,  1.02889494, -0.17441065, -0.51869206,  1.42177154],
       [ 1.44314117,  0.60315773,  1.6326528 ,  0.22600397,  0.10719243],
       [ 0.80312777, -1.77211608, -0.57017728,  0.26355023,  0.55028908],
       [-0.34164354, -0.63510971,  0.6263407 , -0.68603592, -0.50053817]])

#### 12. Create 3x4 shaped array with random int numbers between 20 and 50 with numpy

In [15]:
np.random.randint(20,50,size=(3,4))

array([[20, 39, 22, 20],
       [23, 42, 35, 33],
       [48, 47, 26, 38]])

#### 13. Reshape the array below with shape 6x8

In [17]:
ranarr = np.random.randint(0,60,48)

In [18]:
ranarr

array([56,  6,  0, 26, 35,  7, 41,  3, 52, 29, 42, 30, 30, 47, 12, 58, 28,
       50, 44,  7, 36, 56,  0, 43,  5,  8, 15, 52, 12, 18, 39, 48, 55, 21,
       50, 30,  6, 23, 42, 42,  7,  0, 19, 51, 32,  4, 17, 38])

In [19]:
ranarr.reshape(6,8)

array([[56,  6,  0, 26, 35,  7, 41,  3],
       [52, 29, 42, 30, 30, 47, 12, 58],
       [28, 50, 44,  7, 36, 56,  0, 43],
       [ 5,  8, 15, 52, 12, 18, 39, 48],
       [55, 21, 50, 30,  6, 23, 42, 42],
       [ 7,  0, 19, 51, 32,  4, 17, 38]])

In [21]:
#reshape with -1
ranarr.reshape(-1,12)

array([[56,  6,  0, 26, 35,  7, 41,  3, 52, 29, 42, 30],
       [30, 47, 12, 58, 28, 50, 44,  7, 36, 56,  0, 43],
       [ 5,  8, 15, 52, 12, 18, 39, 48, 55, 21, 50, 30],
       [ 6, 23, 42, 42,  7,  0, 19, 51, 32,  4, 17, 38]])

In [22]:
ranarr.reshape(-1,8)

array([[56,  6,  0, 26, 35,  7, 41,  3],
       [52, 29, 42, 30, 30, 47, 12, 58],
       [28, 50, 44,  7, 36, 56,  0, 43],
       [ 5,  8, 15, 52, 12, 18, 39, 48],
       [55, 21, 50, 30,  6, 23, 42, 42],
       [ 7,  0, 19, 51, 32,  4, 17, 38]])

## Numpy Indexing and Selection

In [25]:
#Create array below
mat= np.arange(1,17).reshape(4,4)
mat

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

#### 14. Write code that reproduces the output shown below.<br>

In [26]:
mat[1:3,1:3]

array([[ 6,  7],
       [10, 11]])

#### 15. Get the first column of the array.

In [27]:
mat[:,0]

array([ 1,  5,  9, 13])

#### 16. Get the values in 2nd row for every 2 step.

In [28]:
mat[1,::2]

array([5, 7])

#### 17.Assign 77 to every cell in 3rd column.

In [29]:
mat

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [32]:

mat[:,2]=77
mat

array([[ 1,  2, 77,  4],
       [ 5,  6, 77,  8],
       [ 9, 10, 77, 12],
       [13, 14, 77, 16]])

#### 18. Take 2nd row 1st column, 4th row 2nd column.

In [35]:
#mat[[1,3],[0,2]] >[5,77]
#mat[[2,4],[1,2]] 4. satır olmadığı için istenen yanlış fakat 
mat[[1,3],[0,1]]

array([ 5, 14])

#### 19. Take between 2nd and last row with step 2 and between 1 and last column with step 2.

In [36]:
mat[1::2,0::2]

array([[ 5, 77],
       [13, 77]])

## NumPy Operations

#### 20. Get the sum of values smaller than 10 and values bigger than 12 from array above

In [37]:
mat

array([[ 1,  2, 77,  4],
       [ 5,  6, 77,  8],
       [ 9, 10, 77, 12],
       [13, 14, 77, 16]])

In [38]:
mat[mat<10]

array([1, 2, 4, 5, 6, 8, 9])

In [39]:
mat[mat>12]

array([77, 77, 77, 13, 14, 77, 16])

In [40]:
mat[mat<10]+mat[mat>12]

array([78, 79, 81, 18, 20, 85, 25])

#### 21. Get the standard deviation of the result above

In [41]:
(mat[mat<10]+mat[mat>12]).std()

29.700546274093877

#### 22. Get the sum of second column from array above

In [43]:
#print array here
mat[:,2]=[3,7,11,15]
mat

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [46]:
mat[:,1].sum(axis=0)

32

#### 23. Get the median,mean and std of 3rd row from array above

In [47]:
mat

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [48]:
mat[2]

array([ 9, 10, 11, 12])

In [49]:
#median
np.median(mat[2])

10.5

In [50]:
#mean
np.mean(mat[2])

10.5

In [51]:
#std
np.std(mat[2])

1.118033988749895

# Pandas Section

In [66]:
import pandas as pd

**Read Salaries.csv take a look at first 5 rows, df info and df statistical measurements**

In [91]:
sal=pd.read_csv('Salaries (1).csv')

In [92]:
sal.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [93]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40409 entries, 0 to 40408
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                40409 non-null  int64
 1   EmployeeName      40409 non-null  object
 2   JobTitle          40409 non-null  object
 3   BasePay           40408 non-null  float64
 4   OvertimePay       40408 non-null  float64
 5   OtherPay          40408 non-null  float64
 6   Benefits          4249 non-null   float64
 7   TotalPay          40408 non-null  float64
 8   TotalPayBenefits  40408 non-null  float64
 9   Year              40408 non-null  float64
 10  Notes             0 non-null      float64
 11  Agency            40408 non-null  object
 12  Status            0 non-null      float64
dtypes: float64(9), int64(1), object(3)
memory usage: 4.0+ MB

In [94]:
sal.describe()

                 Id        BasePay    OvertimePay  ...          Year  Notes  Status
count  40409.000000   40408.000000   40408.000000  ...  40408.000000    0.0     0.0
mean   20205.000000   71096.685778    5982.550624  ...   2011.105152    NaN     NaN
std    11665.217851   45068.269721   13351.669634  ...      0.306754    NaN     NaN
min        1.000000       0.000000       0.000000  ...   2011.000000    NaN     NaN
25%    10103.000000   40675.032500       0.000000  ...   2011.000000    NaN     NaN
50%    20205.000000   66431.535000       0.000000  ...   2011.000000    NaN     NaN
75%    30307.000000  105195.145000    5424.432500  ...   2011.000000    NaN     NaN
max    40409.000000  302578.000000  245131.880000  ...   2012.000000    NaN     NaN

[8 rows x 10 columns]

**How many different year value are there**

In [95]:
sal.Year.value_counts()

2011.0    36159
2012.0     4249
Name: Year, dtype: int64

**Print out max and avg Totalpay**

In [96]:
#max
sal.TotalPay.max()

567595.43

In [97]:
#avg
sal.TotalPay.mean()

81589.21936200929

**How many records are there which have TotalPay bigger than avg TotalPay**

In [99]:
len(sal[sal.TotalPay>sal.TotalPay.mean()])

18193

**How much does ALBERT PARDINI make (including benefits)?**

In [100]:
sal[sal["EmployeeName"]=="ALBERT PARDINI"]["TotalPayBenefits"]

2    335279.91
Name: TotalPayBenefits, dtype: float64

**Who is lowest paid person**

In [102]:
sal[sal.TotalPayBenefits==sal.TotalPayBenefits.min()]["EmployeeName"]

36156        PAULETTE ADAMS
36157         KAUKAB MOHSIN
36158    JOSEPHINE MCCREARY
Name: EmployeeName, dtype: object

**What are the unique Jobs in dataset?**

In [104]:
sal["JobTitle"].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ...,
       'Senior Electrical Inpsector', 'Electrical Inspector',
       'Ex Asst to Ex Dir, Retirement'], dtype=object)

**List 3 least common Jobs**

In [107]:
sal.JobTitle.value_counts().tail(3)

AUDIOLOGIST                         1
ZOO CURATOR                         1
SECRETARY TO THE PRESIDING JUDGE    1
Name: JobTitle, dtype: int64

**How many people earned more than avg in 2012**

In [108]:
sal[(sal.TotalPayBenefits>sal.TotalPayBenefits.mean())&(sal.Year==2012)]["EmployeeName"].count()

4249

**How many people have the word Manager in their job title?**

In [109]:
#use apply function here
def manager_func(x):
  if "manager" in x.lower():
      return True
  else:
    return False

In [110]:
len(sal[sal.JobTitle.apply(lambda x:manager_func(x))])

1526

**Take Id,EmployeeName,JobTitle,TotalPay and TotalPayBenefits columns with iloc and assign it as sal_new dataframe**

In [111]:
sal.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [112]:
sal_new=sal.iloc[:,[0,1,2,7,8]]
sal_new

          Id       EmployeeName  ...   TotalPay  TotalPayBenefits
0          1     NATHANIEL FORD  ...  567595.43         567595.43
1          2       GARY JIMENEZ  ...  538909.28         538909.28
2          3     ALBERT PARDINI  ...  335279.91         335279.91
3          4  CHRISTOPHER CHONG  ...  332343.61         332343.61
4          5    PATRICK GARDNER  ...  326373.19         326373.19
...      ...                ...  ...        ...               ...
40404  40405        David Parry  ...  142345.29         177142.58
40405  40406       Francisco Ho  ...  142567.23         177141.77
40406  40407    Manuel Gonzales  ...  133375.98         177140.62
40407  40408     Lauro Baca III  ...  142601.38         177137.16
40408  40409    Milagros Brosas  ...        NaN               NaN

[40409 rows x 5 columns]

**Take columns betweeen EmployeeName and TotalPayBenefits with loc and assign it o sal_new df**

In [113]:
sal_new=sal_new.loc[:,"EmployeeName":"TotalPayBenefits"]
sal_new

            EmployeeName  ... TotalPayBenefits
0         NATHANIEL FORD  ...        567595.43
1           GARY JIMENEZ  ...        538909.28
2         ALBERT PARDINI  ...        335279.91
3      CHRISTOPHER CHONG  ...        332343.61
4        PATRICK GARDNER  ...        326373.19
...                  ...  ...              ...
40404        David Parry  ...        177142.58
40405       Francisco Ho  ...        177141.77
40406    Manuel Gonzales  ...        177140.62
40407     Lauro Baca III  ...        177137.16
40408    Milagros Brosas  ...              NaN

[40409 rows x 4 columns]

**Print out the names of the employees who earn more than min, but less than avg**

In [116]:
sal[(sal.TotalPayBenefits>sal.TotalPayBenefits.min())&(sal.TotalPayBenefits<sal.TotalPayBenefits.mean())]["EmployeeName"]

12661         GARY DAWSON
12662         LISA FARFAN
12663    MANUEL SALAMANCA
12664            JAMES WU
12665       MILDRED SINGH
               ...
36151         MARVA MOORE
36152     MARCELLA TUCKER
36153       ROCK CRAWFORD
36154       SERENA HUGHES
36155        JOE BROWN JR
Name: EmployeeName, Length: 23495, dtype: object